# How to reproduce the issue

Create a `main.tf` file:

```hcl
provider "aws" {
  region = "us-east-1"
}

resource "aws_iam_role" "foo" {
  force_detach_policies = true

  assume_role_policy = data.aws_iam_policy_document.assume.json

  managed_policy_arns = [aws_iam_policy.foo.arn]
}

data "aws_iam_policy_document" "assume" {
  statement {
    effect = "Allow"
    principals {
      type        = "Service"
      identifiers = ["ec2.amazonaws.com"]
    }
    actions = ["sts:AssumeRole"]
  }
}

resource "aws_iam_policy" "foo" {
  # name_prefix = "foo-"

  policy = data.aws_iam_policy_document.s3.json
}

data "aws_iam_policy_document" "s3" {
  statement {
    effect = "Allow"
    actions = ["s3:ListBuckets"]
    resources = ["*"]
  }
}
```

Run:

```shell
terraform init
terraform apply
```

Edit the code an uncomment the line:

```hcl
name_prefix = "foo-"
```

Run:

```shell
terraform apply
```

## Expected behavior

- The IAM policy is deleted and recreated.
- The IAM policy is attached back to the IAM role.

## Actual result

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.foo must be replaced
-/+ resource "aws_iam_policy" "foo" {
      ~ arn         = "arn:aws:iam::133755658995:policy/terraform-20231219112300376300000001" -> (known after apply)
      ~ id          = "arn:aws:iam::133755658995:policy/terraform-20231219112300376300000001" -> (known after apply)
      ~ name        = "terraform-20231219112300376300000001" -> (known after apply)
      ~ name_prefix = "terraform-" -> "foo-" # forces replacement
      ~ policy_id   = "ANPAR6JDVMLZU4HXRVLPZ" -> (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role.foo will be updated in-place
  ~ resource "aws_iam_role" "foo" {
        id                    = "terraform-20231219112301301200000002"
      ~ managed_policy_arns   = [
          - "arn:aws:iam::133755658995:policy/terraform-20231219112300376300000001",
        ] -> (known after apply)
        name                  = "terraform-20231219112301301200000002"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_iam_policy.foo: Destroying... [id=arn:aws:iam::133755658995:policy/terraform-20231219112300376300000001]
╷
│ Error: deleting IAM Policy (arn:aws:iam::133755658995:policy/terraform-20231219112300376300000001): DeleteConflict: Cannot delete a policy attached to entities.
│       status code: 409, request id: 3762ddfa-35dd-4117-a672-8e3f36b5c678
```